# Duplicates

Exploring the repeating records with in the dataset.

In [8]:
import pandas as pd

In [9]:
df = pd.read_csv("../.warn-transformer/processed/consolidated.csv")

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40082 entries, 0 to 40081
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   jobs         35323 non-null  float64
 1   date         35794 non-null  object
 2   postal_code  40082 non-null  object
 3   location     35877 non-null  object
 4   hash_id      40082 non-null  object
 5   company      40079 non-null  object
dtypes: float64(1), object(5)
memory usage: 1.8+ MB

In [11]:
df.head()

,jobs,date,postal_code,location,hash_id,company
0,40.0,2021-09-16,AK,Anchorage,b855422a87ece9da20ec6571e2f8f6f48521d4e06610e5...,Bean’s Cafe
1,134.0,2021-07-02,AK,Prudhoe Bay,2214cbc57e63037a436152aeb018819a5e8777e2e8eab1...,Kakivik Asset Mgmt
2,185.0,2021-04-30,AK,"Fairbanks, North Pole",20c76d62449eb697b6f95288b8982e36586afd99fc7b7c...,First Student
3,59.0,2021-04-12,AK,Anchorage,0ca0a89d9a684741de7f5199ef69ffc948b5df7e93e22c...,GCI Communication Group
4,NaN,2020-09-30,AK,"Anchorage and 20 smaller Alaska communities, p...",b7c5bb7e614fcce37f1f8c7ba00786faa5482270039b5c...,"RavnAir Group, Corvus Airlines, Hageland Aviat..."

In [12]:
dupes_df = df[df.duplicated()]

In [13]:
dupes_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 176 entries, 367 to 30620
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   jobs         175 non-null    float64
 1   date         59 non-null     object
 2   postal_code  176 non-null    object
 3   location     176 non-null    object
 4   hash_id      176 non-null    object
 5   company      176 non-null    object
dtypes: float64(1), object(5)
memory usage: 9.6+ KB

In [14]:
dupes_df.sort_values("hash_id").head()

,jobs,date,postal_code,location,hash_id,company
21366,332.0,NaN,MO,Mexico,001f1fd9ad1edbca416fb47e84f51387a0161d9561a1f8...,Spartan Light Metal Products - Mexico
21430,84.0,NaN,MO,Kansas City,00615e29c56ff4a46a1c0de9fcd7a023b60e3141a1c800...,Enterprise Holdings - National and Alamo Rent ...
20642,NaN,2012-12-27,MD,"7603 Energy Parkway, Baltimore, MD",01a93ea1aa834f89e8af754db49ef52822fa73e5c86be2...,Commerce Corporation
21381,14.0,NaN,MO,Monett (7) & Joplin (7),0247d1bfa9256b763989545228578abea24368747e457d...,Justin Retail
23377,224.0,2022-03-20,NJ,Jersey City,035c1c8c3ecf3d8fc7078b674507a9c586b9839a3fc892...,NY Daily News -Liberty View Production Facility

In [15]:
dupes_df.groupby("postal_code").size().rename("total").reset_index()

   postal_code  total
0           AL      1
1           CA     31
2           CO     10
3           FL      1
4           GA      1
5           IA      1
6           IN      1
7           MD      1
8           MO    106
9           NE      4
10          NJ     15
11          OR      1
12          TX      3

In [16]:
dupes_df[dupes_df.postal_code == "AL"]

,jobs,date,postal_code,location,hash_id,company
367,55.0,2009-03-16,AL,Mobile,6ba1dec3f427574208540669deabfd72f8e1b010b09415...,FOOD WORLD

In [17]:
df[df.company == "FOOD WORLD"]

,jobs,date,postal_code,location,hash_id,company
366,55.0,2009-03-16,AL,Mobile,6ba1dec3f427574208540669deabfd72f8e1b010b09415...,FOOD WORLD
367,55.0,2009-03-16,AL,Mobile,6ba1dec3f427574208540669deabfd72f8e1b010b09415...,FOOD WORLD
368,47.0,2009-03-16,AL,Mobile,37f32b25496761417e3726d0837a1f5f2e45f95743e2f8...,FOOD WORLD
369,52.0,2009-03-16,AL,Mobile,022c4e55e01708e3a7e2aa409dbfb23e26fbad576f2f21...,FOOD WORLD
370,48.0,2009-03-16,AL,Mobile,6ebd71fd1cefb2a5e6b78b93f8d805f73ebbcedd0f151a...,FOOD WORLD
371,30.0,2009-03-16,AL,Theodore,8fdd85f0f71a115756c8c53405e1b1d16a31403ca0f3c0...,FOOD WORLD
372,30.0,2009-03-16,AL,Saraland,ca756dbb16123b2af998d28a57096e40655212e25c618f...,FOOD WORLD
382,74.0,2009-03-16,AL,McCalla,cddd82742109fc9737be38e363488f44d4a7b710ee83d3...,FOOD WORLD
383,42.0,2009-03-16,AL,Trussville,043d07383931257c63f7a6bf144621b6834913c4d24fd0...,FOOD WORLD
384,42.0,2009-03-16,AL,Birmingham,d0df97c489f035c3cc211245d0a532b4f105ece9276490...,FOOD WORLD
385,60.0,2009-03-16,AL,Hueytown,2141f5f9058162daa0f66422ff515383b40390da778934...,FOOD WORLD
386,40.0,2009-03-16,AL,Birmingham,aa611087449d3c6136370c1b72b1c8d9f50b0844edee03...,FOOD WORLD
393,48.0,2009-03-16,AL,Gardendale,c16eddb865089136a11c7708e90cde1f15403083d5848e...,FOOD WORLD
442,47.0,2009-03-16,AL,Dora,c40bfb6aa7555915468678f195da58b72c76c9620334f0...,FOOD WORLD
455,62.0,2009-03-16,AL,Moody,124df3ccd67c98790fc70c0c616c278018e07dcf154d8a...,FOOD WORLD
456,72.0,2009-03-16,AL,Tuscaloosa,a5df4a935119c5ff2178133f6978bd1b52674daed335bf...,FOOD WORLD
457,51.0,2009-03-16,AL,Prattville,541f29391d3935a0c2e45efaf890ad7385fab7969c1034...,FOOD WORLD
458,55.0,2009-03-16,AL,Tuscaloosa,b54f062b285c735ff5b0bf0ab9d46456c43a34f3a0ddc9...,FOOD WORLD
459,67.0,2009-03-16,AL,Jasper,c384c7c37c5cd7700ed4f8b03dfe779e715bf66163f048...,FOOD WORLD
460,64.0,2009-03-16,AL,Monroeville,d1dbd09693f47fb8120bc170cc194864559b28257ddf64...,FOOD WORLD
461,62.0,2009-03-16,AL,Demopolis,5394b68acc8413b6dc92dd4da6036040b0fbdb9392d7c4...,FOOD WORLD
462,40.0,2009-03-16,AL,Gadsden,268f2f623cde0fa77fa97b788a6c26aded5f5b1bd11efb...,FOOD WORLD
463,64.0,2009-03-16,AL,Sylacauga,890811493c75d4c4ce32efe47ffccc129b0c8b264c721a...,FOOD WORLD
464,56.0,2009-03-16,AL,Pell City,22fe0923b6862b0af6c5ee82626e206614041550255a96...,FOOD WORLD
465,45.0,2009-03-16,AL,Pelham,4934963a7375adab8caa83869bac67b7b0e7b3c74e6b79...,FOOD WORLD
466,48.0,2009-03-16,AL,Rainbow City,bc6b4f5a66dfa15ce676c7754b3bcd7db9886c508c9219...,FOOD WORLD
467,35.0,2009-03-16,AL,Gadsden,fa479885b4e594534e877213bf2c453d04e32900a32dd3...,FOOD WORLD
468,64.0,2009-03-16,AL,Tuscaloosa,99591f5bd61acdd1521a7ebaef8a0cf254c3b0ea943c6f...,FOOD WORLD
469,49.0,2009-03-16,AL,Cullman,d35d4c9b4fe0d83204009e02a2bb3879fc522ba8fd3d2b...,FOOD WORLD